xml-converter/xml-parser/test-data/ProjectsByCompanyIDBulkRequest_Out.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:glob="http://minienm.nl/mendix/global">
   <soapenv:Header/>
   <soapenv:Body>
      <glob:ProjectsByCompanyIDBulkRequestMessage_async>
         <!--Optional:-->
         <MessageHeader>
            <!--Optional:-->
            <ID>?</ID>
            <!--Optional:-->
            <UUID>?</UUID>
            <!--Optional:-->
            <ReferenceID>?</ReferenceID>
            <!--Optional:-->
            <ReferenceUUID>?</ReferenceUUID>
            <CreationDateTime>?</CreationDateTime>
            <!--Optional:-->
            <TestDataIndicator>?</TestDataIndicator>
            <!--Optional:-->
            <SenderBusinessSystemID>?</SenderBusinessSystemID>
            <!--Optional:-->
            <RecipientBusinessSystemID>?</RecipientBusinessSystemID>
            <!--Optional:-->
            <SenderPartyID>?</SenderPartyID>
            <!--Zero or more repetitions:-->
            <RecipientPartyID>?</RecipientPartyID>
            <!--Optional:-->
            <BusinessScopeID>?</BusinessScopeID>
         </MessageHeader>
         <!--Optional:-->
         <Companies>
            <!--Zero or more repetitions:-->
            <Company>
               <ID>?</ID>
            </Company>
         </Companies>
      </glob:ProjectsByCompanyIDBulkRequestMessage_async>
   </soapenv:Body>
</soapenv:Envelope>